IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/SPI0_1.0.xml
    </group>
    <register id="SPI0_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="INT0_CFG" description="Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT0]" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="INT1_CFG" description="Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT1]" begin="3" end="2" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="INT2_CFG" description="Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT2]" begin="5" end="4" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
    <register id="SPI0_INTCTL" width="32" offset="0x10E4" description="Interrupt control register">
        <bitfield id="INTEVAL" description="Writing a 1 to this field re-evaluates the interrupt sources." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="EVAL" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
        </bitfield>
    </register>
    <register id="SPI0_CTL0" width="32" offset="0x1100" description="SPI control register 0">
        <bitfield id="DSS" description="Data Size Select.
Values 0 - 2 are reserved and shall not be used.
3h = 4_BIT : 4-bit data
SPI allows only values up to 16 Bit" begin="4" end="0" width="5" rwaccess="R/W">
            <bitenum id="DSS_4" value="0x3" description="Data Size Select bits: 4"/>
            <bitenum id="DSS_5" value="0x4" description="Data Size Select bits: 5"/>
            <bitenum id="DSS_6" value="0x5" description="Data Size Select bits: 6"/>
            <bitenum id="DSS_7" value="0x6" description="Data Size Select bits: 7"/>
            <bitenum id="DSS_8" value="0x7" description="Data Size Select bits: 8"/>
            <bitenum id="DSS_9" value="0x8" description="Data Size Select bits: 9"/>
            <bitenum id="DSS_10" value="0x9" description="Data Size Select bits: 10"/>
            <bitenum id="DSS_11" value="0xA" description="Data Size Select bits: 11"/>
            <bitenum id="DSS_12" value="0xB" description="Data Size Select bits: 12"/>
            <bitenum id="DSS_13" value="0xC" description="Data Size Select bits: 13"/>
            <bitenum id="DSS_14" value="0xD" description="Data Size Select bits: 14"/>
            <bitenum id="DSS_15" value="0xE" description="Data Size Select bits: 15"/>
            <bitenum id="DSS_16" value="0xF" description="Data Size Select bits: 16"/>
            <bitenum id="DSS_32" value="0x1F" description="Data Size Select bits: 32"/>
        </bitfield>
        <bitfield id="FRF" description="Frame format Select" begin="6" end="5" width="2" rwaccess="R/W">
            <bitenum id="MOTOROLA_3WIRE" value="0x0" description="Motorola SPI frame format (3 wire mode)"/>
            <bitenum id="MOTOROLA_4WIRE" value="0x1" description="Motorola SPI frame format (4 wire mode)"/>
            <bitenum id="TI_SYNC" value="0x2" description="TI synchronous serial frame format"/>
            <bitenum id="MIRCOWIRE" value="0x3" description="National Microwire frame format"/>
        </bitfield>
        <bitfield id="SPO" description="CLKOUT polarity (Motorola SPI frame format only)" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="LOW" value="0x0" description="SPI produces a steady state LOW value on the CLKOUT"/>
            <bitenum id="HIGH" value="0x1" description="SPI produces a steady state HIGH value on the CLKOUT"/>
        </bitfield>
        <bitfield id="SPH" description="CLKOUT phase (Motorola SPI frame format only)
This bit selects the clock edge that captures data and enables it to change state. It
has the most impact on the first bit transmitted by either permitting or not permitting a clock transition before the first data capture edge." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="FIRST" value="0x0" description="Data is captured on the first clock edge transition."/>
            <bitenum id="SECOND" value="0x1" description="Data is captured on the second clock edge transition."/>
        </bitfield>
        <bitfield id="CSSEL" description="Select the CS line to control on data transfer
This bit is for controller mode only." begin="13" end="12" width="2" rwaccess="R/W">
            <bitenum id="CSSEL_0" value="0x0" description="CS line select: 0"/>
            <bitenum id="CSSEL_1" value="0x1" description="CS line select: 1"/>
            <bitenum id="CSSEL_2" value="0x2" description="CS line select: 2"/>
            <bitenum id="CSSEL_3" value="0x3" description="CS line select: 3"/>
        </bitfield>
        <bitfield id="CSCLR" description="Clear shift register counter on CS inactive
This bit is relevant only in the peripheral, CTL1.MS=0." begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable automatic clear of shift register when CS goes to disable."/>
            <bitenum id="ENABLE" value="0x1" description="Enable automatic clear of shift register when CS goes to disable."/>
        </bitfield>
        <bitfield id="PACKEN" description="Packing Enable.
When 1, packing feature is enabled inside the IP
When 0, packing feature is disabled inside the IP" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLED" value="0x0" description="Packing feature disabled"/>
            <bitenum id="ENABLED" value="0x1" description="Packing feature enabled"/>
        </bitfield>
    </register>
